In [166]:
import pandas as pd
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.svm import SVC
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split
import numpy as np

In [147]:
df_train=pd.read_csv("../data/titanic/train.csv")
df_test=pd.read_csv("../data/titanic/test.csv")

In [148]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [149]:
X['Embarked'].value_counts()

0.0    646
1.0    168
2.0     77
Name: Embarked, dtype: int64

In [150]:
X=df_train.drop(['Survived','Name','Cabin','Ticket'],axis=1)
y=df_train['Survived']

In [151]:
X['Sex']=X['Sex'].map({'female':0,'male':1})
X.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0            1       3    1  22.0      1      0   7.2500        S
1            2       1    0  38.0      1      0  71.2833        C
2            3       3    0  26.0      0      0   7.9250        S
3            4       1    0  35.0      1      0  53.1000        S
4            5       3    1  35.0      0      0   8.0500        S

In [152]:

X['Embarked']=X['Embarked'].map({'S':0,'C':1,'Q':2})
X.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1       3    1  22.0      1      0   7.2500       0.0
1            2       1    0  38.0      1      0  71.2833       1.0
2            3       3    0  26.0      0      0   7.9250       0.0
3            4       1    0  35.0      1      0  53.1000       0.0
4            5       3    1  35.0      0      0   8.0500       0.0

In [153]:
X.shape

(891, 8)

In [154]:
X.isnull().sum()

PassengerId      0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [155]:
mn=np.mean(X['Age'])

In [156]:
X['Age']=X['Age'].fillna(mn)

In [157]:
X['Embarked'].value_counts()

0.0    644
1.0    168
2.0     77
Name: Embarked, dtype: int64

In [158]:
X['Embarked']=X['Embarked'].fillna(0.0)

In [159]:
X.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1       3    1  22.0      1      0   7.2500       0.0
1            2       1    0  38.0      1      0  71.2833       1.0
2            3       3    0  26.0      0      0   7.9250       0.0
3            4       1    0  35.0      1      0  53.1000       0.0
4            5       3    1  35.0      0      0   8.0500       0.0

In [160]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=.3)

In [161]:
X_train.head()

     PassengerId  Pclass  Sex        Age  SibSp  Parch     Fare  Embarked
211          212       2    0  35.000000      0      0  21.0000       0.0
38            39       3    0  18.000000      2      0  18.0000       0.0
861          862       2    1  21.000000      1      0  11.5000       0.0
100          101       3    0  28.000000      0      0   7.8958       0.0
198          199       3    0  29.699118      0      0   7.7500       2.0

In [162]:
inst=LogisticRegression()
fit=inst.fit(X_train,y_train)
y_pred=fit.predict(X_test)

C:\Users\603766\AppData\Local\Continuum\anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

In [163]:
accuracy_score(y_pred,y_test)

0.8544776119402985